[{"title":"NASA's Mars Reconnaissance Orbiter Undergoes Memory Update","tease":"Other orbiters will continue relaying data from Mars surface missions for a two-week period."},{"title":"While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus","tease":"This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."},{"title":"NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate","tease":"Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."},{"title":"Mars 2020 Stands on Its Own Six Wheels","tease":"In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels."},{"title":"The MarCO Mission Comes to an End","tease":"The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."},{"title":"Curiosity Mars Rover's Summer Road Trip Has Begun","tease":"After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."},{"title":"NASA's Mars 2020 Rover Closer to Getting Its Name","tease":"155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July."},{"title":"Naming a NASA Mars Rover Can Change Your Life","tease":"Want to name the robotic scientist NASA is sending to Mars in 2020? The student who named Curiosity — the rover currently exploring Mars — will tell you this is an opportunity worth taking."},{"title":"NASA's Mars Helicopter Attached to Mars 2020 Rover ","tease":"The helicopter will be first aircraft to perform flight tests on another planet."},{"title":"Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate","tease":"A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."},{"title":"How NASA's Perseverance Mars Team Adjusted to Work in the Time of Coronavirus ","tease":"Like much of the rest of the world, the Mars rover team is pushing forward with its mission-critical work while putting the health and safety of their colleagues and community first."},{"title":"3 Things We've Learned From NASA's Mars InSight ","tease":"Scientists are finding new mysteries since the geophysics mission landed two years ago."},{"title":"NASA Wins 4 Webbys, 4 People's Voice Awards","tease":"Winners include the JPL-managed \"Send Your Name to Mars\" campaign, NASA's Global Climate Change website and Solar System Interactive."},{"title":"NASA Updates Mars 2020 Mission Environmental Review","tease":"NASA and the Department of Energy have completed a more detailed risk analysis for the Mars 2020 rover launch from Florida."},{"title":"NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities","tease":"Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."}]